class Translation(object):
    START_TEXT = """ʜɪ👋 {},\nɪ'ᴍ ᴀ ᴜʀʟ ᴜᴘʟᴏᴀᴅᴇʀ ʙᴏᴛ! ʏᴏᴜ ᴄᴀɴ ᴜᴘʟᴏᴀᴅ ᴅɪʀᴇᴄᴛ ʟɪɴᴋ, ᴜꜱɪɴɢ ᴛʜɪꜱ ʙᴏᴛ.\n\n/help ꜰᴏʀ ᴍᴏʀᴇ ᴅᴇᴛᴀɪʟꜱ!"""
    FORMAT_SELECTION = "ᴘʟᴇᴀꜱᴇ ꜱᴇʟᴇᴄᴛ ᴛʜᴇ ᴅᴇꜱɪʀᴇᴅ ꜰᴏʀᴍᴀᴛ:ꜰɪʟᴇ ꜱɪᴢᴇ ᴍɪɢʜᴛ ʙᴇ ᴀᴘᴘʀᴏxɪᴍᴀᴛᴇ."
    SET_CUSTOM_USERNAME_PASSWORD = """\n ɪꜰ ʏᴏᴜ ᴡᴀɴᴛ ᴛᴏ ᴅᴏᴡɴʟᴏᴀᴅ ᴘʀᴇᴍɪᴜᴍ ᴠɪᴅᴇᴏꜱ, ᴘʀᴏᴠɪᴅᴇ ɪɴ ᴛʜᴇ ꜰᴏʟʟᴏᴡɪɴɢ ꜰᴏʀᴍᴀᴛ: ᴜʀʟ | ꜰɪʟᴇɴᴀᴍᴇ | ᴜꜱᴇʀɴᴀᴍᴇ | ᴘᴀꜱꜱᴡᴏʀᴅ]"""
    DOWNLOAD_START = "ᴅᴏᴡɴʟᴏᴀᴅɪɴɢ ꜰɪʟᴇ ᴛᴏ ᴍʏ ᴅᴀᴛᴀʙᴀꜱᴇ....ɪᴛ ᴄᴀɴ ᴛᴀᴋᴇ ꜱᴏᴍᴇ ᴛɪᴍᴇ ᴅᴇᴘᴇɴᴅ ᴏɴ ꜰɪʟᴇ ꜱɪᴢᴇ."
    UPLOAD_START = "ꜰɪʟᴇ ᴅᴏᴡɴʟᴏᴀᴅᴇᴅ ꜱᴜᴄᴄᴇꜱꜱꜰᴜʟʟʏ. \n\n ɴᴏᴡ ᴜᴘʟᴏᴀᴅɪɴɢ📤..."
    RCHD_TG_API_LIMIT = "ᴅᴏᴡɴʟᴏᴀᴅᴇᴅ ɪɴ {} ꜱᴇᴄᴏɴᴅꜱ.\n ᴅᴇᴛᴇᴄᴛᴇᴅ ꜰɪʟᴇ ꜱɪᴢᴇ: {}, ꜱᴏʀʀʏ. ʙᴜᴛ, ɪ ᴄᴀɴɴᴏᴛ ᴜᴘʟᴏᴀᴅ ꜰɪʟᴇꜱ ɢʀᴇᴀᴛᴇʀ ᴛʜᴀɴ 2ɢʙ ᴅᴜᴇ ᴛᴏ ᴛᴇʟᴇɢʀᴀᴍ ᴀᴘɪ ʟɪᴍɪᴛᴀᴛɪᴏɴꜱ."
    AFTER_SUCCESSFUL_UPLOAD_MSG = "ʏᴏᴜʀ ꜰɪʟᴇ ᴜᴘʟᴏᴀᴅᴇᴅ, ɴᴏᴡ ɢɪᴠᴇ ᴍᴇ 10/-."
    AFTER_SUCCESSFUL_UPLOAD_MSG_WITH_TS = "ᴅᴏᴡɴʟᴏᴀᴅᴇᴅ ɪɴ {} ꜱᴇᴄᴏɴᴅꜱ.\nᴜᴘʟᴏᴀᴅᴇᴅ ɪɴ {} ꜱᴇᴄᴏɴᴅꜱ.\n\nɴᴏᴡ ɢɪᴠᴇ ᴍᴇ 1$."
    SAVED_CUSTOM_THUMB_NAIL = "✅ ᴄᴜꜱᴛᴏᴍ ᴛʜᴜᴍʙɴᴀɪʟ ꜱᴀᴠᴇᴅ."
    DEL_ETED_CUSTOM_THUMB_NAIL = "✅ ᴄᴜꜱᴛᴏᴍ ᴛʜᴜᴍʙɴᴀɪʟ ᴄʟᴇᴀʀᴇᴅ ꜱᴜᴄᴄᴇꜱꜰᴜʟʟʏ."
    CUSTOM_CAPTION_UL_FILE = "{}"
    NO_VOID_FORMAT_FOUND = "ᴇʀʀᴏʀ...\ɴ<ʙ>ʏᴏᴜᴛᴜʙᴇᴅʟ ꜱᴀɪᴅ: {}"
    HELP_USER = """ʜᴏᴡ ᴛᴏ ᴜꜱᴇ ᴍᴇ? ꜰᴏʟʟᴏᴡ ᴛʜᴇꜱᴇ ꜱᴛᴇᴘꜱ! 
    1. ꜱᴇɴᴅ ᴜʀʟ (ᴇxᴀᴍᴘʟᴇ.ᴅᴏᴍᴀɪɴ/ꜰɪʟᴇ.ᴍᴘ4 | ɴᴇᴡ ꜰɪʟᴇɴᴀᴍᴇ.ᴍᴘ4).
    2. ꜱᴇɴᴅ ɪᴍᴀɢᴇ ᴀꜱ ᴄᴜꜱᴛᴏᴍ ᴛʜᴜᴍʙɴᴀɪʟ (ᴏᴘᴛɪᴏɴᴀʟ).
    3. ꜱᴇʟᴇᴄᴛ ᴛʜᴇ ʙᴜᴛᴛᴏɴ.   
    -ꜱᴠɪᴅᴇᴏ - ɢɪᴠᴇ ꜰɪʟᴇ ᴀꜱ ᴠɪᴅᴇᴏ ᴡɪᴛʜ ꜱᴄʀᴇᴇɴꜱʜᴏᴛꜱ   
    -ᴅꜰɪʟᴇ  - ɢɪᴠᴇ ꜰɪʟᴇ (ᴠɪᴅᴇᴏ) ᴀꜱ ꜰɪʟᴇ ᴡɪᴛʜ ꜱᴄʀᴇᴇɴꜱʜᴏᴛꜱ   
    -ᴠɪᴅᴇᴏ  - ɢɪᴠᴇ ꜰɪʟᴇ ᴀꜱ ᴠɪᴅᴇᴏ ᴡɪᴛʜᴏᴜᴛ ꜱᴄʀᴇᴇɴꜱʜᴏᴛꜱ    
    -ꜰɪʟᴇ   - ɢɪᴠᴇ ꜰɪʟᴇ ᴡɪᴛʜᴏᴜᴛ ꜱᴄʀᴇᴇɴꜱʜᴏᴛꜱ
"""
    REPLY_TO_MEDIA_ALBUM_TO_GEN_THUMB = "ʀᴇᴘʟʏ /generatecustomthumbnail ᴛᴏ ᴀ ᴍᴇᴅɪᴀ ᴀʟʙᴜᴍ, ᴛᴏ ɢᴇɴᴇʀᴀᴛᴇ ᴄᴜꜱᴛᴏᴍ ᴛʜᴜᴍʙ"
    ERR_ONLY_TWO_MEDIA_IN_ALBUM = """ᴍᴇᴅɪᴀ ᴀʟʙᴜᴍ ꜱʜᴏᴜʟᴅ ᴄᴏɴᴛᴀɪɴ ᴏɴʟʏ ᴛᴡᴏ ᴘʜᴏᴛᴏꜱ. ᴘʟᴇᴀꜱᴇ ʀᴇ-ꜱᴇɴᴅ ᴛʜᴇ ᴍᴇᴅɪᴀ ᴀʟʙᴜᴍ, ᴀɴᴅ ᴛʜᴇɴ ᴛʀʏ ᴀɢᴀɪɴ, ᴏʀ ꜱᴇɴᴅ ᴏɴʟʏ ᴛᴡᴏ ᴘʜᴏᴛᴏꜱ ɪɴ ᴀɴ ᴀʟʙᴜᴍ.\nʏᴏᴜ ᴄᴀɴ ᴜꜱᴇ /rename ᴄᴏᴍᴍᴀɴᴅ ᴀꜰᴛᴇʀ ʀᴇᴄᴇɪᴠɪɴɢ ꜰɪʟᴇ ᴛᴏ ʀᴇɴᴀᴍᴇ ɪᴛ ᴡɪᴛʜ ᴄᴜꜱᴛᴏᴍ ᴛʜᴜᴍʙɴᴀɪʟ ꜱᴜᴘᴘᴏʀᴛ."""
    CANCEL_STR = "𝙋𝙧𝙤𝙘𝙚𝙨𝙨 𝘾𝙖𝙣𝙘𝙚𝙡𝙡𝙚𝙙"
    ZIP_UPLOADED_STR = "𝙐𝙥𝙡𝙤𝙖𝙙𝙚𝙙 {} 𝙛𝙞𝙡𝙚𝙨 𝙞𝙣 {} 𝙨𝙚𝙘𝙤𝙣𝙙𝙨\n\n𝙂𝙞𝙫𝙚 𝙢𝙚 1$"
    SLOW_URL_DECED = "ᴛʜᴀᴛ ꜱᴇᴇᴍꜱ ᴛᴏ ʙᴇ ᴀ ᴠᴇʀʏ ꜱʟᴏᴡ ᴜʀʟ. ꜱɪɴᴄᴇ ʏᴏᴜ ᴡᴇʀᴇ ꜱᴄʀᴇᴡɪɴɢ ᴍʏ ʜᴏᴍᴇ, ɪ ᴀᴍ ɪɴ ɴᴏ ᴍᴏᴏᴅ ᴛᴏ ᴅᴏᴡɴʟᴏᴀᴅ ᴛʜɪꜱ ꜰɪʟᴇ.\n\nᴍᴇᴀɴᴡʜɪʟᴇ, ᴡʜʏ ᴅᴏɴ'ᴛ ʏᴏᴜ ᴛʀʏ ᴛʜɪꜱ:==> https://shrtz.me/PtsVnf6 ᴀɴᴅ ɢᴇᴛ ᴍᴇ ᴀ ꜰᴀꜱᴛ ᴜʀʟ ꜱᴏ ᴛʜᴀᴛ ɪ ᴄᴀɴ ᴜᴘʟᴏᴀᴅ ᴛᴏ ᴛᴇʟᴇɢʀᴀᴍ, ᴡɪᴛʜᴏᴜᴛ ᴍᴇ ꜱʟᴏᴡɪɴɢ ᴅᴏᴡɴ ꜰᴏʀ ᴏᴛʜᴇʀ ᴜꜱᴇʀꜱ."

    ERROR_YTDLP = "𝙥𝙡𝙚𝙖𝙨𝙚 𝙧𝙚𝙥𝙤𝙧𝙩 𝙩𝙝𝙞𝙨 𝙞𝙨𝙨𝙪𝙚 𝙤𝙣 https://yt-dl.org/bug . 𝙈𝙖𝙠𝙚 𝙨𝙪𝙧𝙚 𝙮𝙤𝙪 𝙖𝙧𝙚 𝙪𝙨𝙞𝙣𝙜 𝙩𝙝𝙚 𝙡𝙖𝙩𝙚𝙨𝙩 𝙫𝙚𝙧𝙨𝙞𝙤𝙣; 𝙨𝙚𝙚  https://yt-dl.org/update  𝙤𝙣 𝙝𝙤𝙬 𝙩𝙤 𝙪𝙥𝙙𝙖𝙩𝙚. 𝘽𝙚 𝙨𝙪𝙧𝙚 𝙩𝙤 𝙘𝙖𝙡𝙡 𝙮𝙤𝙪𝙩𝙪𝙗𝙚-𝙙𝙡 𝙬𝙞𝙩𝙝 𝙩𝙝𝙚 --𝙫𝙚𝙧𝙗𝙤𝙨𝙚 𝙛𝙡𝙖𝙜 𝙖𝙣𝙙 𝙞𝙣𝙘𝙡𝙪𝙙𝙚 𝙞𝙩𝙨 𝙘𝙤𝙢𝙥𝙡𝙚𝙩𝙚 𝙤𝙪𝙩𝙥𝙪𝙩."
